In [2]:
from bs4 import BeautifulSoup
from lxml import etree as ET
import pandas as pd
import unicodedata
import matplotlib.pyplot as plt 
import plotly.express as px
import numpy as np
import polars as pl

In [4]:
dump = pl.read_parquet('data/online_diss_cleaned_03-2024.parquet') 
data = dump.to_pandas()
#data = pd.read_csv('data/check-data-csv.csv')
#data

In [5]:
#Get missing years from 008: 
data['Year'] = data['Year'].fillna(data['008'].str[7:11])

In [6]:
# Filter entries that don't have a publication date and reduce timespan: 

data1 = data[data['Year'].notna()]
data1.query("Year.str.len() == 4")

data1 = data1.astype({'Year':'int'})
data1 = data1[(data1['Year'] >= 1990) & (data1['Year'] <= 2023)]
data2 = data1[data1['Year'] >= 1990]

print("Data: ", len(data))
print("Data 1990-2023: ", len(data1))
print("Data >= 1990: ", len(data2))

Data:  324782
Data 1990-2023:  321558
Data >= 1990:  321558

In [7]:
#create new dataframe that only includes the publication year and value count: 
s = data1['Year'].value_counts().sort_index()

new = pd.DataFrame(s)
new = new.rename(columns={"Year": "count"})
new['years'] = new.index
new

      count  years
Year
1990     35   1990
1991     49   1991
1992     55   1992
1993     53   1993
1994     75   1994
1995    110   1995
1996    129   1996
1997    332   1997
1998    755   1998
1999   1796   1999
2000   3862   2000
2001   5418   2001
2002   6993   2002
2003   8196   2003
2004   9461   2004
2005  10266   2005
2006  11390   2006
2007  11769   2007
2008  12482   2008
2009  13007   2009
2010  13385   2010
2011  13038   2011
2012  14251   2012
2013  14571   2013
2014  15313   2014
2015  15649   2015
2016  16385   2016
2017  16082   2017
2018  16818   2018
2019  17298   2019
2020  17839   2020
2021  19011   2021
2022  18653   2022
2023  17032   2023

In [8]:
#check data: 

df2 = new['count'].sum()
df2

321558

In [9]:
no_data = data[data['Year'].isnull()]
no_data

Empty DataFrame
Columns: [ID, Creator, Title, lang, Place, Year, DDC, DDC1, DDC2, DDC-DE?, Sachgruppe, diss, notes, 008]
Index: []

In [10]:
data1.loc[data1["Year"] == "unknown"]

Empty DataFrame
Columns: [ID, Creator, Title, lang, Place, Year, DDC, DDC1, DDC2, DDC-DE?, Sachgruppe, diss, notes, 008]
Index: []

In [11]:
new.to_json("data/diss_years.json", index=True)